tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "mongodb/brew"
tap "codecademy-engineering/bootstrap"

##########
# Ruby
##########

# Ruby version manager
brew "rbenv"
# Auto-installs gems for Ruby installs
brew "rbenv-default-gems"

##########
# Nodejs
##########

# Manage multiple Node.js versions
brew "nvm"

##########
# Go
##########

# Open source programming language to build simple/reliable/efficient software
brew "go"

##########
# Python3
##########

# Interpreted, interactive, object-oriented programming language
brew "python"

##########
# Docker
##########

# Pack, ship and run any application as a lightweight container
cask "docker"

##########
# k8s
##########

# Kubernetes command-line interface
brew "kubernetes-cli"
# Kubernetes package manager
brew "codecademy-engineering/bootstrap/helm@3.3.4"
# Deploy Kubernetes Helm Charts
brew "codecademy-engineering/bootstrap/helmfile@0.132.1"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"

##########
# Misc
##########

# bash 4.1+ and bash-completion v2
brew "bash"
brew "bash-completion@2"
# SSL/TLS cryptography library
brew "openssl"
# General-purpose command-line fuzzy finder
brew "fzf"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Object-relational database system
brew "postgresql"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Official Amazon AWS command-line interface
brew "awscli"
# https://github.com/99designs/aws-vault
cask "aws-vault"
# Session Manager Plugin for the AWS CLI
cask "session-manager-plugin"
# Package for GNU standards-compliant Makefiles
brew "automake"
# GNU generic library support script
brew "libtool"
# GNU File, Shell, and Text utilities
brew "coreutils"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU grep, egrep and fgrep
brew "grep"
# Collection of GNU find, xargs, and locate
brew "findutils"
# Manipulates uploaded images
brew "imagemagick"

# Terraform version manager inspired by rbenv
brew "tfenv"

# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community@4.0"
