tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "mongodb/brew"

##########
# Ruby
##########

# Ruby version manager
brew "rbenv"
# Auto-installs gems for Ruby installs
brew "rbenv-default-gems"

##########
# Nodejs
##########

# Manage multiple Node.js versions
brew "nvm"

##########
# Go
##########

# Open source programming language to build simple/reliable/efficient software
brew "go"
# Go dependency management tool
brew "dep"

##########
# Python3
##########

# Interpreted, interactive, object-oriented programming language
brew "python"

##########
# Docker
##########

# Pack, ship and run any application as a lightweight container
cask "docker"

##########
# k8s
##########

# Kubernetes command-line interface
brew "kubernetes-cli"
# The Kubernetes package manager
# To-do: See pin_helm() in bootstrap.sh.
# brew "kubernetes-helm"
# Deploy Kubernetes Helm Charts
brew "helmfile"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Kubernetes cluster creator/maintainer
brew "kops"

##########
# Misc
##########

# bash 4.1+ and bash-completion v2
brew "bash"
brew "bash-completion@2"
# SSL/TLS cryptography library
brew "openssl"
# General-purpose command-line fuzzy finder
brew "fzf"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Object-relational database system
brew "postgresql"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Official Amazon AWS command-line interface
brew "awscli@1"
# https://github.com/99designs/aws-vault
cask "aws-vault"
# Session Manager Plugin for the AWS CLI
cask "session-manager-plugin"
# Package for GNU standards-compliant Makefiles
brew "automake"
# GNU generic library support script
brew "libtool"

# Tool to build, change, and version infrastructure
brew "terraform"

# High-performance, schema-free, document-oriented database
brew "mongodb/brew/mongodb-community@3.6"
